music_app/app/controllers/albums_controller.rb

    def new
        @bands = Band.all
        @band = Band.find_by(id: params[:band_id])
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def create
        @album = Album.new(album_params)
        @band = Band.find_by(id: @album.band_id)
        @bands = Band.all
        if @album.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "bands".* FROM "bands"
INSERT INTO "albums" ("title", "year", "is_live", "created_at", "updated_at", "band_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "HI"], ["year", 1999], ["is_live", true], ["created_at", "2019-04-05 04:10:32.514636"], ["updated_at", "2019-04-05 04:10:32.514636"], ["band_id", 11]]

    def show
        @album = Album.find_by(id: params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]

    def edit
        @bands = Band.all
        @album = Album.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands"
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

    def destroy
        @album = Album.find_by(id: params[:id])
        Album.delete(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 3]]